---
kind: method
id: M:Autodesk.Revit.DB.DisplacementElement.RemoveDisplacedElement(Autodesk.Revit.DB.Element)
source: html/a5d36a3a-e62a-ff86-bb7e-2572bef749f0.htm
---
# Autodesk.Revit.DB.DisplacementElement.RemoveDisplacedElement Method

Remove a displaced element from this DisplacementElement.

## Syntax (C#)
```csharp
public void RemoveDisplacedElement(
	Element ElemToRemove
)
```

## Parameters
- **ElemToRemove** (`Autodesk.Revit.DB.Element`) - The element to remove.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null